dsgt2-soap/requestOrder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://foodmenu.io/gt/webservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:addOrderRequest>
            <gs:address>leuven</gs:address>
            <gs:meals>
                <gs:mealName>Steak</gs:mealName>
                <gs:mealName>Portobello</gs:mealName>
                <gs:mealName>Fish and Chips</gs:mealName>
            </gs:meals>
        </gs:addOrderRequest>
    </soapenv:Body>
</soapenv:Envelope>